Config/Documents/ЗаявкаНаНаличныеБанковскаяКарта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаявкаНаНаличныеБанковскаяКарта</Name>
			<Comment>Заявка на получение денежных средств,перечисляемых на карту</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БезналичныеДенежныеСредства</xr:Item>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Работник</Name>
					<Comment>Работник, которому доверено получение наличных денег</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботникДолжность</Name>
					<Comment>Должность работника</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботникФИО</Name>
					<Comment>ФИО работника</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредельнаяДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОбязательства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганКазначейства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Казначейства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерваяПодпись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВтораяПодпись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерваяПодписьПечататьДолжность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВтораяПодписьПечататьДолжность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВтораяПодписьДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерваяПодписьДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РеквизитыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектФАИП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
						<v8:Type>cfg:CatalogRef.МероприятияПоИнформатизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКонтракта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИсточникСредств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИсточникиСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КБКНазначениеПлатежа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КОСГУНазначениеПлатежа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаНазначениеПлатежа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>210</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>254</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЦели</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦелевыхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМероприятия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопКлассификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДополнительнаяБюджетнаяКлассификация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КассовыйСимвол</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСимволы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Enums/ТипыЛицевыхСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыЛицевыхСчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Казначейский</Name>
					<Comment>Лицевой счет открыт в органе казначейства или финансовом органе</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Банковский</Name>
					<Comment>Счет открыт в учреждении банка, кредитной организации или на едином казначейском счете</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/НастройкиКонтроляОбязательств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>НастройкиКонтроляОбязательств</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поставляемая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОбъектаМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаКонтроля</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольРПД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольДО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольБО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиКонтроляРПД</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрольПо</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкиКонтроляДО</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрольПо</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкиКонтроляБО</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрольПо</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Documents/ЗаявкаНаНаличныеБанковскаяКарта/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.РеквизитыЛицевогоСчета) Тогда
			
			ПолучитьРеквизитыЛицевогоСчетаПоУмолчанию();
			
		Иначе
			
			ПриИзмененииЛицевогоСчета();
			
		КонецЕсли;	
		
	КонецЕсли;
	
	Элементы.РасшифровкаПлатежаИсточникСредств.СписокВыбора.ЗагрузитьЗначения(ПлатежноРасчетныеДокументыПовтИсп.ДопустимыеИсточникиСредств(Объект.ЛицевойСчет));
	
	ПлатежноРасчетныеДокументы.ЗаполнитьДопустимыеКФОиИсточникиСредств(Объект.ЛицевойСчет,СписокДопустимыхКФО,СписокИсточниковСредствПоКФО);
	
	СвойстваЛицевогоСчета 		= ПлатежноРасчетныеДокументыПовтИсп.ПолучитьСвойстваЛицевогоСчета(Объект.ЛицевойСчет, Объект.Дата); 
	
	РазницаИтогаТЧ = Объект.РасшифровкаПлатежа.Итог("Сумма") - Объект.СуммаДокумента;


    // Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ,
													 СтандартнаяОбработка, 
													 Элементы.БухгалтерскаяОперация, 
													 Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	// Централизованная бухгалтерия
	ЗаполнениеРеквизитовОбъектов.ОпределитьПараметрыВыбораСотрудников(ЭтаФорма, Объект.Организация);
	// Конец Централизованная бухгалтерия
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПлатежноРасчетныеДокументы.ПриСозданииНаСервереФормыДокумента(ЭтаФорма);
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

    // Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма,
												   ТекущийОбъект, 
												   Элементы.БухгалтерскаяОперация, 
												   Элементы.ДополнительныеТабличныеЧасти);
    // Конец Типовые операции и дополнительные табличные части
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма);
	
	ПлатежноРасчетныеДокументы.ПередЗаписьюНаСервереДокумента(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтаФорма);

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьДоступностьРеквизитовОрганизации();
	
	БухгалтерскиеОперацииКлиент.ПриОткрытии(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

    // Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части

	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	ПлатежноРасчетныеДокументыКлиент.ОбработатьОповещения(ЭтаФорма, ИмяСобытия, Параметр, Источник);

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТиповыхОпераций

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтаФорма.Элементы[ИмяЭлемента]);	

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)
	
    БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент)

	БухгалтерскиеОперацииКлиент.ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтаФорма, Команда);	

КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ПолучитьРеквизитыЛицевогоСчетаПоУмолчанию();
	ПриИзменеБанковскойКарты();
	ПриИзмененииРаботника();
	УстановитьДоступностьРеквизитовОрганизации();
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	ПриИзмененииЛицевогоСчета();
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Организация, ТекущаяСтрока, ТипЛицевогоСчета, НаДату", Объект.Организация, Объект.РеквизитыЛицевогоСчета, ПредопределенноеЗначение("Перечисление.ТипыЛицевыхСчетов.Казначейский"), Объект.Дата);
	ОткрытьФорму("Справочник.РеквизитыЛицевыхСчетов.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Объект.РеквизитыЛицевогоСчета 	= ВыбранноеЗначение;
	ПолучитьЛицевойСчетОрганКазначейства();
КонецПроцедуры

&НаКлиенте
Процедура СуммаДокументаПриИзменении(Элемент)
	
	РазницаИтогаТЧ = Объект.РасшифровкаПлатежа.Итог("Сумма") - Объект.СуммаДокумента;

КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	Объект.НомерОбязательства = ДоговорНомерОбязательства(Объект.Договор);
КонецПроцедуры

&НаКлиенте
Процедура ПерваяПодписьПечататьДолжностьПриИзменении(Элемент)
	Объект.ПерваяПодписьДолжность =  УстановитьДолжность(Объект.ПерваяПодпись, Объект.ПерваяПодписьПечататьДолжность,Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ВтораяПодписьПечататьДолжностьПриИзменении(Элемент)
	Объект.ВтораяПодписьДолжность =  УстановитьДолжность(Объект.ВтораяПодпись, Объект.ВтораяПодписьПечататьДолжность,Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ПерваяПодписьПриИзменении(Элемент)
	Объект.ПерваяПодписьДолжность =  УстановитьДолжность(Объект.ПерваяПодпись, Объект.ПерваяПодписьПечататьДолжность,Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ВтораяПодписьПриИзменении(Элемент)
	Объект.ВтораяПодписьДолжность =  УстановитьДолжность(Объект.ВтораяПодпись, Объект.ВтораяПодписьПечататьДолжность,Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура БанковскаяКартаПриИзменении(Элемент)
	ПриИзменеБанковскойКарты();
КонецПроцедуры

&НаКлиенте
Процедура РаботникПриИзменении(Элемент)
	ПриИзмененииРаботника();
КонецПроцедуры

&НаКлиенте
Процедура УстановленныйСтатусДокументаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ИзменитьСтатусДокумента();
КонецПроцедуры

&НаКлиенте
Процедура СтатусЭтогоДокументаНажатие(Элемент)
	ИзменитьСтатусДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРасшифровкаПлатежа

&НаКлиенте
Процедура РасшифровкаПлатежаКБКНазначениеПлатежаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	БухгалтерскийУчетКлиент.ПроверитьОчиститьКЭК(ТекущиеДанные.КБКНазначениеПлатежа, ТекущиеДанные.КОСГУНазначениеПлатежа); 
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаКБКНазначениеПлатежаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.РасшифровкаПлатежа.ТекущиеДанные;

	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораКПС(	Элемент, 
													СтандартнаяОбработка, 
													ТекущиеДанные.КБКНазначениеПлатежа, 
													Объект.Организация,
													Объект.ИФО,
													,
													,
													Объект.Дата);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НЕ НоваяСтрока Тогда
		Возврат
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.КФО) Тогда
		Если Элемент.ТекущиеДанные.НомерСтроки > 1 Тогда
			Элемент.ТекущиеДанные.КФО = Объект.РасшифровкаПлатежа[Элемент.ТекущиеДанные.НомерСтроки-2].КФО;
		Иначе
			Если СписокДопустимыхКФО.Количество() > 0 Тогда
				Элемент.ТекущиеДанные.КФО = СписокДопустимыхКФО[0].Значение;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.ИсточникСредств) Тогда
		Если Элемент.ТекущиеДанные.НомерСтроки > 1 Тогда
			Элемент.ТекущиеДанные.ИсточникСредств = Объект.РасшифровкаПлатежа[Элемент.ТекущиеДанные.НомерСтроки-2].ИсточникСредств;
		Иначе
			ИсточникиСредствПоКФО = СписокИсточниковСредствПоКФО.НайтиСтроки(Новый Структура("КФО",Элемент.ТекущиеДанные.КФО));
			Если ИсточникиСредствПоКФО.Количество() > 0 Тогда
				СписокИСпоКФО = ИсточникиСредствПоКФО[0].СписокИсточников;
				Если СписокИСпоКФО.Количество() > 0 Тогда
					Элемент.ТекущиеДанные.ИсточникСредств = СписокИСпоКФО[0].Значение;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.СуммаДокумента) Тогда
		Элемент.ТекущиеДанные.Сумма = Объект.СуммаДокумента - (Объект.РасшифровкаПлатежа.Итог("Сумма") - Элемент.ТекущиеДанные.Сумма);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	РазницаИтогаТЧ = Объект.РасшифровкаПлатежа.Итог("Сумма") - Объект.СуммаДокумента;

КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПослеУдаления(Элемент)
	
	РазницаИтогаТЧ = Объект.РасшифровкаПлатежа.Итог("Сумма") - Объект.СуммаДокумента;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаИсточникСредствНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
	ИсточникиСредствПоКФО = СписокИсточниковСредствПоКФО.НайтиСтроки(Новый Структура("КФО",ТекущиеДанные.КФО));
	Если ИсточникиСредствПоКФО.Количество() > 0 Тогда
		Элементы.РасшифровкаПлатежаИсточникСредств.СписокВыбора.ЗагрузитьЗначения(ИсточникиСредствПоКФО[0].СписокИсточников.ВыгрузитьЗначения());
	Иначе
		Элементы.РасшифровкаПлатежаИсточникСредств.СписокВыбора.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаКФОПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
	ИсточникиСредствПоКФО = СписокИсточниковСредствПоКФО.НайтиСтроки(Новый Структура("КФО",ТекущиеДанные.КФО));
	
	Если ИсточникиСредствПоКФО.Количество() > 0 Тогда
		СписокИСпоКФО = ИсточникиСредствПоКФО[0].СписокИсточников;
		Если СписокИСпоКФО.НайтиПоЗначению(ТекущиеДанные.ИсточникСредств) = Неопределено Тогда
			ТекущиеДанные.ИсточникСредств = "";
			Если СписокИСпоКФО.Количество() > 0 Тогда
				ТекущиеДанные.ИсточникСредств = СписокИСпоКФО[0].Значение;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ТекущиеДанные.ИсточникСредств = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура КонтрольДокументаПоОбязательствам(Команда)
	Адрес = Неопределено;
	
	ЕстьПревышения = КонтрольДокументаПоОбязательствамСервер(Адрес);
	
	Если ЕстьПревышения Тогда
		ОткрытьФорму("Справочник.НастройкиКонтроляОбязательств.Форма.ФормаРезультатовПроверки", Новый Структура("Адрес, ПредставлениеДокумента", Адрес, Объект.Ссылка));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСуммуПлатежа(Команда)
	
	Объект.СуммаДокумента 	= Объект.РасшифровкаПлатежа.Итог("Сумма");
	РазницаИтогаТЧ 			= 0;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьРеквизитыЛицевогоСчетаПоУмолчанию()
	
	Умолчания = Справочники.ЛицевыеСчета.ПолучитьРеквизитыЛицевогоСчетаПоУмолчанию(Объект.Организация, "Документ.ЗаявкаНаНаличныеБанковскаяКарта", Объект.Дата, Перечисления.ТипыЛицевыхСчетов.Казначейский);
	
	Объект.ЛицевойСчет 				= Умолчания.ЛицевойСчет;
	Объект.РеквизитыЛицевогоСчета 	= Умолчания.РеквизитыЛицевогоСчета;
	Объект.ОрганКазначейства		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РеквизитыЛицевогоСчета, "КассовыйОрган");
	
	ПриИзмененииЛицевогоСчета();
	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ДоговорНомерОбязательства(Договор)
	Возврат РаботаСОбязательствами.ПолучитьУчетныйНомерОбязательства(Договор);
КонецФункции	

&НаСервереБезКонтекста
Функция УстановитьДолжность(Знач Подпись, ПодписьПечататьДолжность, Дата)
	Возврат ПлатежноРасчетныеДокументыПовтИсп.ПолучитьДолжностьСотрудника(Подпись, ПодписьПечататьДолжность, Дата);
КонецФункции

&НаСервере
Процедура ПолучитьЛицевойСчетОрганКазначейства()
	
	Объект.ЛицевойСчет 				= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РеквизитыЛицевогоСчета, "Владелец");
	Объект.ОрганКазначейства		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РеквизитыЛицевогоСчета, "КассовыйОрган");
	
   	ПриИзмененииЛицевогоСчета();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСвойстваЛицевогоСчета(Знач ПараметрыОбъекта, ДопустимыеИсточникиСредств)
	
	ДопустимыеИсточникиСредств 	= ПлатежноРасчетныеДокументыПовтИсп.ДопустимыеИсточникиСредств(ПараметрыОбъекта.ЛицевойСчет);
   	СвойстваЛицевогоСчета 		= ПлатежноРасчетныеДокументыПовтИсп.ПолучитьСвойстваЛицевогоСчета(ПараметрыОбъекта.ЛицевойСчет, ПараметрыОбъекта.Дата); 	
	
	Возврат СвойстваЛицевогоСчета;

КонецФункции

&НаСервере
Процедура ПриИзмененииЛицевогоСчета()
	
	Перем ДопустимыеИсточникиСредств;
	
	ПараметрыОбъекта = Новый Структура("ЛицевойСчет,Дата");
	ЗаполнитьЗначенияСвойств(ПараметрыОбъекта,Объект);
	
	СвойстваЛицевогоСчета = ПолучитьСвойстваЛицевогоСчета(ПараметрыОбъекта, ДопустимыеИсточникиСредств);
	
	Если ЗначениеЗаполнено(Объект.ЛицевойСчет) тогда
		Объект.ПерваяПодпись				 	= СвойстваЛицевогоСчета.ПерваяПодпись;
		Объект.ВтораяПодпись 					= СвойстваЛицевогоСчета.ВтораяПодпись;
		Объект.ВтораяПодписьПечататьДолжность 	= СвойстваЛицевогоСчета.ВтораяПодписьПечататьДолжность;
		Объект.ПерваяПодписьПечататьДолжность 	= СвойстваЛицевогоСчета.ПерваяПодписьПечататьДолжность;
		Объект.ПерваяПодписьДолжность         	= СвойстваЛицевогоСчета.ПерваяПодписьДолжность;
		Объект.ВтораяПодписьДолжность		  	= СвойстваЛицевогоСчета.ВтораяПодписьДолжность;
		
	Иначе
		Объект.ВтораяПодписьПечататьДолжность 	= Ложь;
		Объект.ПерваяПодписьПечататьДолжность 	= Ложь;
		Объект.ПерваяПодписьДолжность         	= "";
		Объект.ВтораяПодписьДолжность		  	= "";
		Объект.ОрганКазначейства				= "";
	КонецЕсли;	
	
	Элементы.РасшифровкаПлатежаИсточникСредств.СписокВыбора.ЗагрузитьЗначения(ДопустимыеИсточникиСредств);
	
	ПлатежноРасчетныеДокументы.ЗаполнитьДопустимыеКФОиИсточникиСредств(Объект.ЛицевойСчет,СписокДопустимыхКФО,СписокИсточниковСредствПоКФО);
	
	Для Каждого Стр Из Объект.РасшифровкаПлатежа Цикл
		
		Если СписокДопустимыхКФО.НайтиПоЗначению(Стр.КФО) = Неопределено Тогда
			Стр.КФО = "";
			Если СписокДопустимыхКФО.Количество() > 0 Тогда
				Стр.КФО = СписокДопустимыхКФО[0].Значение;
			КонецЕсли;
		КонецЕсли;
		
		ДопустимыеИсточникиСредств = ПлатежноРасчетныеДокументыПовтИсп.ДопустимыеИсточникиСредств(Объект.ЛицевойСчет,Стр.КФО);
		Если ДопустимыеИсточникиСредств.Найти(Стр.ИсточникСредств) = Неопределено Тогда
			Стр.ИсточникСредств = "";
			Если ДопустимыеИсточникиСредств.Количество() > 0 Тогда
				Стр.ИсточникСредств = ДопустимыеИсточникиСредств[0];
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеРаботника(Знач Работник,Дата)
	Возврат ПлатежноРасчетныеДокументыПовтИсп.ПолучитьДанныеСотрудника(Работник,Дата);
КонецФункции	

&НаКлиенте
ПРоцедура ПриИзмененииРаботника()
	Объект.РаботникФИО	= "";
	Объект.РаботникДолжность	= "";
	
	Если ЗначениеЗаполнено(Объект.Работник) тогда
		ДанныеРаботника = ПолучитьДанныеРаботника(Объект.Работник,Объект.Дата);
		
		Объект.РаботникДолжность = ДанныеРаботника.Должность;
		Объект.РаботникФИО	= ?(ЗначениеЗаполнено(ДанныеРаботника.ВыдатьКому),ДанныеРаботника.ВыдатьКому,НСтр("ru = '"+ДанныеРаботника.Фамилия+" "+ДанныеРаботника.Имя+" "+ДанныеРаботника.Отчество+"'"));;
	КонецЕсли;
	
КонецПРоцедуры	

&НаСервереБезКонтекста
Функция ПолучитьСотрудникаБанковскойКарты(Знач БанковскаяКарта)
	Возврат БанковскаяКарта.Сотрудник;	
КонецФункции	

&НаКлиенте
Процедура ПриИзменеБанковскойКарты()
	Объект.Работник = "";
	Если ЗначениеЗаполнено(объект.БанковскаяКарта) тогда
		Объект.Работник = ПолучитьСотрудникаБанковскойКарты(Объект.БанковскаяКарта);
	КонецЕсли;	
	ПриИзмененииРаботника();
КонецПРоцедуры	

&НаКлиенте
Процедура УстановитьДоступностьРеквизитовОрганизации()

	ДоступностьРеквизитов = ЗначениеЗаполнено(Объект.Организация);
	Элементы.ЛицевойСчет.Доступность = ДоступностьРеквизитов;
	Элементы.Подразделение.Доступность = ДоступностьРеквизитов;
	Элементы.Работник.Доступность = ДоступностьРеквизитов;
	Элементы.БанковскаяКарта.Доступность = ДоступностьРеквизитов;
	Элементы.ПерваяПодпись.Доступность = ДоступностьРеквизитов;
	Элементы.ВтораяПодпись.Доступность = ДоступностьРеквизитов;

КонецПроцедуры // УстановитьДоступностьРеквизитовОрганизации()

&НаСервере
Функция КонтрольДокументаПоОбязательствамСервер(Адрес)
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Ложь, ТекущийОбъект, Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись), ЭтаФорма);
	
	КонтрольРасходов.Контроль(ТекущийОбъект, Ложь,, Истина, Адрес);
	
	Если ЗначениеЗаполнено(Адрес) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ИзменитьСтатусДокумента()
	
	ПлатежноРасчетныеДокументыКлиент.ОткрытьФормуИзмененияСтатусаДокумента(ЭтаФорма);
	
КонецПроцедуры	

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти
	
// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
